app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Heheh"], ["body", "hahahsh"], ["post_id", 3], ["created_at", "2019-08-12 22:45:51.025829"], ["updated_at", "2019-08-12 22:45:51.025829"]]