app/controllers/posts_controller.rb

  def create
    # render plain: params[:post].inspect
    @post = Post.new(post_params)
    if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    @post = Post.find(params[:id])
    if(@post.update(post_params))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3